In [13]:
from math import *
from datascience import *

In [16]:
max(make_array(1,2,3,4))

4

In [4]:
abs(-4)

4

In [18]:
sqrt(-9)

ValueError: math domain error

In [6]:
sqrt(2)

1.4142135623730951

In [19]:
Table()

In [21]:
tbl = Table()

In [23]:
tbl.read_table('../data/ceo.csv')

company         | ceo              | party | amount
3M Co           | Bob Ulrich       | 200   | 8500
3M Co           | Linda Alvarado   | 100   | 11244.6
3M Co           | Robert Ulrich    | 200   | 591450
AES Corporation | Andres Gluski    | 100   | 6000
AES Corporation | Charles Rossotti | 100   | 2500
AES Corporation | Charles Rossotti | 200   | 1000
AES Corporation | John Koskinen    | 100   | 19000
AES Corporation | Kristina Johnson | 100   | 28480
AES Corporation | Philip Lader     | 100   | 2500
AES Corporation | Philip Odeen     | 100   | 750
... (4677 rows omitted)

In [12]:
tbl.read_table('../data/ceo.csv')

company         | ceo              | party | amount
3M Co           | Bob Ulrich       | 200   | 8500
3M Co           | Linda Alvarado   | 100   | 11244.6
3M Co           | Robert Ulrich    | 200   | 591450
AES Corporation | Andres Gluski    | 100   | 6000
AES Corporation | Charles Rossotti | 100   | 2500
AES Corporation | Charles Rossotti | 200   | 1000
AES Corporation | John Koskinen    | 100   | 19000
AES Corporation | Kristina Johnson | 100   | 28480
AES Corporation | Philip Lader     | 100   | 2500
AES Corporation | Philip Odeen     | 100   | 750
... (4677 rows omitted)

In [26]:
tbl = Table().with_columns('name', make_array('Karen','Vee','Michael','Justin'),
                          'OH',make_array('M','T','W','Th'))
tbl

name    | OH
Karen   | M
Vee     | T
Michael | W
Justin  | Th